<a href="https://colab.research.google.com/github/apogace/DATA-612-HW2/blob/main/Anastas_Pogace_Data_612_HW2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Assignment for Week 2

## Purpose:     
This assignment is intended to help you do the following:   
1.	Modify and add information on the dataset by adding and calculating new columns     
2.	Work with dates in a dataset       
3.	Learn how to write and save your work as a csv file from Jupyter Notebook.

## Action Items:       
•	Create a new column using the date column.     
  1. Find the maximum date of your data.     
  2. Subtract all the dates on the column from the maximum date.       
  3. Convert the number of days into number of months.       
  4. Save the result on a new column and add to the data set.        
  5. Save the dataset as a csv file.        
  6. Upload the assignment on your GitHub account and Update the README file where you explain everything you did.

***Anastas Pogace ***

>

In [40]:
import pandas as pd 
df = pd.read_csv('https://raw.githubusercontent.com/frankData612/data_612/master/baseballdatabank-master/core/Salaries.csv')
df

       yearID teamID lgID   playerID    salary
0        1985    ATL   NL  barkele01    870000
1        1985    ATL   NL  bedrost01    550000
2        1985    ATL   NL  benedbr01    545000
3        1985    ATL   NL   campri01    633333
4        1985    ATL   NL  ceronri01    625000
...       ...    ...  ...        ...       ...
26423    2016    WAS   NL  strasst01  10400000
26424    2016    WAS   NL  taylomi02    524000
26425    2016    WAS   NL  treinbl01    524900
26426    2016    WAS   NL  werthja01  21733615
26427    2016    WAS   NL  zimmery01  14000000

[26428 rows x 5 columns]

In [41]:
df.dtypes

yearID       int64
teamID      object
lgID        object
playerID    object
salary       int64
dtype: object

In [42]:
year = df['yearID']
year

0        1985
1        1985
2        1985
3        1985
4        1985
         ...
26423    2016
26424    2016
26425    2016
26426    2016
26427    2016
Name: yearID, Length: 26428, dtype: int64

1. Find the maximum date of your data.

In [43]:
year.describe()

count    26428.000000
mean      2000.878727
std          8.909314
min       1985.000000
25%       1994.000000
50%       2001.000000
75%       2009.000000
max       2016.000000
Name: yearID, dtype: float64

In [44]:
year.max()

2016

2. Subtract all the dates on the column from the maximum date.

In [45]:
neg_year = year - year.max()
neg_year.head(5)

0   -31
1   -31
2   -31
3   -31
4   -31
Name: yearID, dtype: int64

In [46]:
neg_year.tail(5)

26423    0
26424    0
26425    0
26426    0
26427    0
Name: yearID, dtype: int64

3. Convert the number of days into number of months

In [47]:
# since my dataset didnt have a 'days' column to convert, I instead converted the salary column from USD to Euros with the convertion rate of 1USD = .82 Euros
salary_euro = df.salary * .82
salary_euro

0          713400.00
1          451000.00
2          446900.00
3          519333.06
4          512500.00
            ...
26423     8528000.00
26424      429680.00
26425      430418.00
26426    17821564.30
26427    11480000.00
Name: salary, Length: 26428, dtype: float64

In [48]:
salary_euro.shape

(26428,)

4. Save the result on a new column and add to the data set.

In [49]:
df['salary(euros)'] = df.salary * .82
df

       yearID teamID lgID   playerID    salary  salary(euros)
0        1985    ATL   NL  barkele01    870000      713400.00
1        1985    ATL   NL  bedrost01    550000      451000.00
2        1985    ATL   NL  benedbr01    545000      446900.00
3        1985    ATL   NL   campri01    633333      519333.06
4        1985    ATL   NL  ceronri01    625000      512500.00
...       ...    ...  ...        ...       ...            ...
26423    2016    WAS   NL  strasst01  10400000     8528000.00
26424    2016    WAS   NL  taylomi02    524000      429680.00
26425    2016    WAS   NL  treinbl01    524900      430418.00
26426    2016    WAS   NL  werthja01  21733615    17821564.30
26427    2016    WAS   NL  zimmery01  14000000    11480000.00

[26428 rows x 6 columns]

5. Save the dataset as a csv file.

In [52]:
df.to_csv('baseballsalary_altered.csv')